/**************************************************************************************************
**                                                                                               **
**  文件名称:  single_instance.h                                                                 **
**  版权所有:  CopyRight @ LEON WorkStudio CO.LTD. 2017                                          **
**  文件描述:  判断系统中是否已经存在该进程的实例                                                **
**  ===========================================================================================  **
**  创建信息:  | 2017-9-14 | LEON | 创建本模块                                                   **
**  ===========================================================================================  **
**  修改信息:  单击此处添加....                                                                  **
**************************************************************************************************/
#ifndef SINGLE_INSTANCE_H
#define SINGLE_INSTANCE_H

#ifdef __cplusplus
extern "C"
{
#endif

int proc_is_exist(const char *procname);

#ifdef __cplusplus
}
#endif

#endif
